
# file: ibert_bank_all.xdc
####################################################################################
##   ____  ____ 
##  /   /\/   /
## /___/  \  /    Vendor: Xilinx
## \   \   \/     Version : 2012.3
##  \   \         Application : IBERT 7Series
##  /   /         Filename : example_ibert_bank_all.xdc
## /___/   /\     
## \   \  /  \ 
##  \___\/\___\
##
##
## 
## Generated by Xilinx IBERT 7Series 
##**************************************************************************
##
## TX/RX out clock and DMONITOR clock constraints
##
# GT X0Y0
create_clock -period 4.000 [get_pins {inst/QUAD[0].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[0].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y1
create_clock -period 4.000 [get_pins {inst/QUAD[0].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[0].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y2
create_clock -period 4.000 [get_pins {inst/QUAD[0].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[0].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y3
create_clock -period 4.000 [get_pins {inst/QUAD[0].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[0].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y4
create_clock -period 4.000 [get_pins {inst/QUAD[1].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[1].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y5
create_clock -period 4.000 [get_pins {inst/QUAD[1].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[1].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y6
create_clock -period 4.000 [get_pins {inst/QUAD[1].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[1].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y7
create_clock -period 4.000 [get_pins {inst/QUAD[1].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[1].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y8
create_clock -period 4.000 [get_pins {inst/QUAD[2].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[2].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y9
create_clock -period 4.000 [get_pins {inst/QUAD[2].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[2].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y10
create_clock -period 4.000 [get_pins {inst/QUAD[2].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[2].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y11
create_clock -period 4.000 [get_pins {inst/QUAD[2].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[2].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y12
create_clock -period 4.000 [get_pins {inst/QUAD[3].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[3].u_q/CH[0].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y13
create_clock -period 4.000 [get_pins {inst/QUAD[3].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[3].u_q/CH[1].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y14
create_clock -period 4.000 [get_pins {inst/QUAD[3].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[3].u_q/CH[2].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
# GT X0Y15
create_clock -period 4.000 [get_pins {inst/QUAD[3].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]
set_clock_groups -asynchronous -group [get_clocks -of_objects [get_pins {inst/QUAD[3].u_q/CH[3].u_ch/u_gtye4_channel/DMONITOROUTCLK}]]
##
## GTYE4 Channel and Common Loc constraints
##
set_property LOC GTYE4_CHANNEL_X0Y0 [get_cells inst/QUAD[0].u_q/CH[0].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y1 [get_cells inst/QUAD[0].u_q/CH[1].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y2 [get_cells inst/QUAD[0].u_q/CH[2].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y3 [get_cells inst/QUAD[0].u_q/CH[3].u_ch/u_gtye4_channel]
set_property LOC GTYE4_COMMON_X0Y0 [get_cells inst/QUAD[0].u_q/u_common/u_gtye4_common]
set_property LOC GTYE4_CHANNEL_X0Y4 [get_cells inst/QUAD[1].u_q/CH[0].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y5 [get_cells inst/QUAD[1].u_q/CH[1].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y6 [get_cells inst/QUAD[1].u_q/CH[2].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y7 [get_cells inst/QUAD[1].u_q/CH[3].u_ch/u_gtye4_channel]
set_property LOC GTYE4_COMMON_X0Y1 [get_cells inst/QUAD[1].u_q/u_common/u_gtye4_common]
set_property LOC GTYE4_CHANNEL_X0Y8 [get_cells inst/QUAD[2].u_q/CH[0].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y9 [get_cells inst/QUAD[2].u_q/CH[1].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y10 [get_cells inst/QUAD[2].u_q/CH[2].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y11 [get_cells inst/QUAD[2].u_q/CH[3].u_ch/u_gtye4_channel]
set_property LOC GTYE4_COMMON_X0Y2 [get_cells inst/QUAD[2].u_q/u_common/u_gtye4_common]
set_property LOC GTYE4_CHANNEL_X0Y12 [get_cells inst/QUAD[3].u_q/CH[0].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y13 [get_cells inst/QUAD[3].u_q/CH[1].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y14 [get_cells inst/QUAD[3].u_q/CH[2].u_ch/u_gtye4_channel]
set_property LOC GTYE4_CHANNEL_X0Y15 [get_cells inst/QUAD[3].u_q/CH[3].u_ch/u_gtye4_channel]
set_property LOC GTYE4_COMMON_X0Y3 [get_cells inst/QUAD[3].u_q/u_common/u_gtye4_common]
## Set case analysis on clock selection
set_case_analysis 0 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/TXRATE[*]]
set_case_analysis 0 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/RXRATE[*]]
		
		

set_case_analysis 1 [get_pins inst/QUAD[0].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[0].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[1]]
set_case_analysis 1 [get_pins inst/QUAD[0].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[2]]

set_case_analysis 0 [get_pins inst/QUAD[0].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[0].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[0].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[2]]

set_case_analysis 1 [get_pins inst/QUAD[0].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[0].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[0].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[2]]

	
set_case_analysis 1 [get_pins inst/QUAD[0].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[0].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[1]]
		
	
set_case_analysis 1 [get_pins inst/QUAD[0].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[0].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[1]]
		
		

set_case_analysis 1 [get_pins inst/QUAD[1].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[1].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[1].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[2]]

set_case_analysis 0 [get_pins inst/QUAD[1].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[1].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[1].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[2]]

set_case_analysis 1 [get_pins inst/QUAD[1].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[1].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[1].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[2]]

	
set_case_analysis 1 [get_pins inst/QUAD[1].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[1].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[1]]
		
	
set_case_analysis 1 [get_pins inst/QUAD[1].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[1].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[1]]
		
		

set_case_analysis 0 [get_pins inst/QUAD[2].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[2].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[2].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[2]]

set_case_analysis 0 [get_pins inst/QUAD[2].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[2].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[2].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[2]]

set_case_analysis 1 [get_pins inst/QUAD[2].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[2].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[2].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[2]]

	
set_case_analysis 1 [get_pins inst/QUAD[2].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[2].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[1]]
		
	
set_case_analysis 1 [get_pins inst/QUAD[2].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[2].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[1]]
		
		

set_case_analysis 0 [get_pins inst/QUAD[3].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[3].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[1]]
set_case_analysis 1 [get_pins inst/QUAD[3].u_q/u_common/u_gtye4_common/QPLL0REFCLKSEL[2]]

set_case_analysis 0 [get_pins inst/QUAD[3].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[3].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[3].u_q/u_common/u_gtye4_common/QPLL1REFCLKSEL[2]]

set_case_analysis 1 [get_pins inst/QUAD[3].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[0]]
set_case_analysis 0 [get_pins inst/QUAD[3].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[3].u_q/CH[*].u_ch/u_gtye4_channel/CPLLREFCLKSEL[2]]

	
set_case_analysis 1 [get_pins inst/QUAD[3].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[3].u_q/CH[*].u_ch/u_gtye4_channel/TXPLLCLKSEL[1]]
		
	
set_case_analysis 1 [get_pins inst/QUAD[3].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[0]]
set_case_analysis 1 [get_pins inst/QUAD[3].u_q/CH[*].u_ch/u_gtye4_channel/RXPLLCLKSEL[1]]

set_case_analysis 0 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/TXOUTCLKSEL[2]]
set_case_analysis 1 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/TXOUTCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/TXOUTCLKSEL[0]]

set_case_analysis 0 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/RXOUTCLKSEL[2]]
set_case_analysis 1 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/RXOUTCLKSEL[1]]
set_case_analysis 0 [get_pins inst/QUAD[*].u_q/CH[*].u_ch/u_gtye4_channel/RXOUTCLKSEL[0]]
